EDT/УТ/src/Reports/ОтчетКМ7/ОтчетКМ7.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетКМ7</name>
</mdclass:Report>

EDT/УТ/src/AccumulationRegisters/ЖурналККМ_КонтрольнаяЛента/ЖурналККМ_КонтрольнаяЛента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЖурналККМ_КонтрольнаяЛента</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерСмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Reports/ОтчетКМ7/ObjectModule.bsl
Функция Печать(Таб, ДатаНач, ДатаКон, КассаККМ = Неопределено) Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты.СуммаНачальныйОстаток,
	            |	ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты.СуммаКонечныйОстаток,
	            |	ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты.КассаККМ.Ссылка
	            |ПОМЕСТИТЬ ВТОстатки
	            |ИЗ
	            |	РегистрНакопления.ЖурналККМ_КонтрольнаяЛента.ОстаткиИОбороты(&НачДата, &КонДата, , , ) КАК ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты.СуммаНачальныйОстаток,
	            |	ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты.СуммаКонечныйОстаток,
	            |	ЖурналККМ_КонтрольнаяЛентаОстаткиИОбороты.КассаККМ.Ссылка
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ЖурналККМ_КонтрольнаяЛента.КассаККМ КАК КассаККМ,
	            |	ЖурналККМ_КонтрольнаяЛента.Кассир КАК Кассир,
	            |	СУММА(ЖурналККМ_КонтрольнаяЛента.Сумма) КАК Выручка,
	            |	СУММА(ЖурналККМ_КонтрольнаяЛента.СуммаВозврата) КАК Возврат,
	            |	ЖурналККМ_КонтрольнаяЛента.НомерСмены КАК НомерКЛ,
	            |	ЕСТЬNULL(ВТОстатки.СуммаНачальныйОстаток, 0) КАК НачОст,
	            |	ЕСТЬNULL(ВТОстатки.СуммаКонечныйОстаток, 0) КАК КонОст,
	            |	СУММА(ВЫБОР
	            |			КОГДА ЖурналККМ_КонтрольнаяЛента.ТипОплаты = ЗНАЧЕНИЕ(Справочник.типыоплат.наличные)
	            |				ТОГДА ЖурналККМ_КонтрольнаяЛента.Сумма
	            |			ИНАЧЕ 0
	            |		КОНЕЦ) КАК ВыручкаНал,
	            |	СУММА(ВЫБОР
	            |			КОГДА ЖурналККМ_КонтрольнаяЛента.ТипОплаты = ЗНАЧЕНИЕ(Справочник.типыоплат.терминал)
	            |				ТОГДА ЖурналККМ_КонтрольнаяЛента.Сумма
	            |			ИНАЧЕ 0
	            |		КОНЕЦ) КАК ВыручкаТер,
	            |	ЖурналККМ_КонтрольнаяЛента.КассаККМ.НомерПроизводителя КАК НомерПроизводителя,
	            |	"""" КАК НомерРегистрационный,
	            |	ЖурналККМ_КонтрольнаяЛента.КассаККМ.Код КАК НомерКассы
	            |ИЗ
	            |	РегистрНакопления.ЖурналККМ_КонтрольнаяЛента КАК ЖурналККМ_КонтрольнаяЛента
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
	            |		ПО ЖурналККМ_КонтрольнаяЛента.КассаККМ.Ссылка = ВТОстатки.КассаККМСсылка.Ссылка
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ЖурналККМ_КонтрольнаяЛента.КассаККМ,
	            |	ЖурналККМ_КонтрольнаяЛента.Кассир,
	            |	ЖурналККМ_КонтрольнаяЛента.НомерСмены,
	            |	ЖурналККМ_КонтрольнаяЛента.КассаККМ.НомерПроизводителя,
	            |	ЖурналККМ_КонтрольнаяЛента.КассаККМ.Код,
	            |	ЕСТЬNULL(ВТОстатки.СуммаНачальныйОстаток, 0),
	            |	ЕСТЬNULL(ВТОстатки.СуммаКонечныйОстаток, 0)
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	НомерКассы
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТОстатки";
				
				
	зап.УстановитьПараметр("НачДата", НачалоДня(ДатаНач));			
	зап.УстановитьПараметр("КонДата", КонецДня(ДатаНач));			
	//Таб = Новый ТабличныйДокумент;
	Мак = ПолучитьМакет("Макет");
	
	Ш = мак.ПолучитьОбласть("Шапка");
	ОблСтр = мак.ПолучитьОбласть("Строка");
	П = мак.ПолучитьОбласть("Подвал");
	
	Ш.Параметры.ДатаСоставления = ДатаКон;
	Таб.Вывести(Ш);
	
	Выб = Зап.Выполнить().Выбрать();	
	ИтВ = 0;
	ИтВН = 0;
	ИтВТ = 0;
	ИтВозвр = 0;
	
	Пока Выб.Следующий() Цикл
		
		ИтВ = ИтВ + Выб.Выручка;
		ИтВозвр = ИтВозвр + Выб.Возврат;
		ИТВН = ИТВН + Выб.ВыручкаНал;
		ИТВТ = ИТВТ + Выб.ВыручкаТер;
		
		ККМ = Выб.КассаККМ;
		Кассир = Выб.Кассир;
		
		//Ш.Параметры.Кассир = Кассир;
		
		//Ш.Параметры.Модель = ККМ.Модель;
		//Ш.Параметры.ПрикладнаяПрограмма = ККМ.ПрикладнаяПрограмма;
		ОблСтр.Параметры.НомерПроизводителя = ККМ.НомерПроизводителя;
		
		ЗаполнитьЗначенияСвойств(ОблСтр.Параметры, Выб);
		Таб.Вывести(ОблСтр);
		
		ДФ = Формат(ДатаКон, "ДЛФ=DD");
	КонецЦикла;
	//П.Параметры.ДД = Лев(ДФ, 2);
	//П.Параметры.МД = Сред(ДФ, 4, СтрДлина(ДФ) - 10);
	//П.Параметры.ГД = Лев(Прав(ДФ, 7), 4);
	П.Параметры.ИтВыр = ИтВ;
	П.Параметры.ИтВыручкаНал = ИтВН;
	П.Параметры.ИтВыручкаТер = ИтВТ;
	П.Параметры.СуммаОшЧековПропись = ОбщегоНазначения.СформироватьСуммуПрописью3(ИтВ - ИтВН - ИтВТ);
	Таб.Вывести(П);
	
	таб.КлючПараметровПечати = "КМ7_";
	Возврат Истина;
КонецФункции
